RedditClone/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @subs = Sub.all
    @sub = Sub.find(params[:sub_id])

SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("url", "title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "subs".* FROM "subs"
---
  def create
    @post = Post.new(post_params)
    @sub = Sub.find(params[:sub_id])
    @post.author_id = current_user.id
    debugger
    if @post.save
      redirect_to sub_url(@sub)
    else
      @subs = Sub.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "saaaaad so sad"], ["content", "about assessment 4 and all other things"], ["updated_at", "2019-02-05 22:34:18.097030"], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def confirm_author
    @post = Post.find(params[:id])