RedditClone/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 12], ["sub_id", 2], ["created_at", "2019-02-06 01:27:30.852734"], ["updated_at", "2019-02-06 01:27:30.852734"]]
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id

    if @post.save