RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("description", "title", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "achoo"], ["title", "sneezes"], ["moderator_id", 1], ["created_at", "2019-02-05 19:46:22.091545"], ["updated_at", "2019-02-05 19:46:22.091545"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id

    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "Super Serious Sub"], ["updated_at", "2019-02-05 20:13:33.676635"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])

    if @sub.update_attributes(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def confirm_moderator
    @sub = Sub.find(params[:id])